---
title: FabricRoundingManager
classe: Autodesk.Revit.DB.Structure.FabricRoundingManager
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.Structure.ReinforcementRoundingManager
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# FabricRoundingManager

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ReinforcementRoundingSource ApplicableReinforcementRoundingSource { get; }` | `fabricRoundingManager.ApplicableReinforcementRoundingSource` | ReinforcementRoundingSource |
| `Double ApplicableSegmentLengthRounding { get; }` | `fabricRoundingManager.ApplicableSegmentLengthRounding` | Double |
| `RoundingMethod ApplicableSegmentLengthRoundingMethod { get; }` | `fabricRoundingManager.ApplicableSegmentLengthRoundingMethod` | RoundingMethod |
| `Double ApplicableTotalLengthRounding { get; }` | `fabricRoundingManager.ApplicableTotalLengthRounding` | Double |
| `RoundingMethod ApplicableTotalLengthRoundingMethod { get; }` | `fabricRoundingManager.ApplicableTotalLengthRoundingMethod` | RoundingMethod |
| `Double SegmentLengthRounding { get; set; }` | `fabricRoundingManager.SegmentLengthRounding` | Double |
| `RoundingMethod SegmentLengthRoundingMethod { get; set; }` | `fabricRoundingManager.SegmentLengthRoundingMethod` | RoundingMethod |
| `Double TotalLengthRounding { get; set; }` | `fabricRoundingManager.TotalLengthRounding` | Double |
| `RoundingMethod TotalLengthRoundingMethod { get; set; }` | `fabricRoundingManager.TotalLengthRoundingMethod` | RoundingMethod |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```